app/Controllers/Dokter.php

    public function store()
    {
        if (!$this->validate([
            'provinsi' => 'required',
            'nama' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Nama harus diisi!'
                ]
            ],
            'no_telp' =>
            [
                'rules' => 'required',
                'errors' => [
                    'required' => 'No Telepon harus diisi!'
                ]
            ],
        ])) {
            $validation = \Config\Services::validation();
            return redirect()->to('/dokter/create')->withInput()->with('validation', $validation);
        }

        $this->m_dokter->save([
            'id_provinsi' => $this->request->getVar('provinsi'),
            'nama' => $this->request->getVar('nama'),
            'no_telp' => $this->request->getVar('no_telp')
        ]);
---
INSERT INTO `dokter` (`id_provinsi`, `nama`, `no_telp`) VALUES ('2', 'Maul', '123123123')