app/Models/m_dokter.php

    public function get_all_dokter()
    {
        $builder = $this->db->table('dokter');
        $builder->select('*');
        $builder->join('provinsi', 'provinsi.id = dokter.id_provinsi');
        $query = $builder->get()->getResultObject();
---
SELECT *
FROM `dokter`
JOIN `provinsi` ON `provinsi`.`id` = `dokter`.`id_provinsi`