app/Models/m_jenis_vaksin.php

SELECT *
FROM `jenis_vaksin`
---
    public function get_jenis_vaksin(){
        $builder = $this->db->table('jenis_vaksin');
        $builder->select('*');
        $query = $builder->get()->getResultObject();