app/Models/m_lokasi_vaksin.php

    public function get_lokasi_vaksin(){
        $builder = $this->db->table('lokasi_vaksin');
        $builder->select('*');
        $builder->join('provinsi', 'provinsi.id = lokasi_vaksin.id_provinsi');
        $query = $builder->get()->getResultObject();
---
SELECT *
FROM `lokasi_vaksin`
JOIN `provinsi` ON `provinsi`.`id` = `lokasi_vaksin`.`id_provinsi`