app/Models/m_provinsi.php

    public function get_all_provinsi()
    {
        return $this->db->table('provinsi')->get()->getResultObject();
---
SELECT *
FROM `provinsi`